---
kind: other
id: Properties.T:Autodesk.Revit.DB.Visual.SchemaCommon
source: html/4cebc6ed-3aa0-a846-3e10-36663add4a09.htm
---
# SchemaCommon Properties

The property labeled "BaseSchema" common to all visual Asset types.